In [3]:
import pandas as pd
pd.DataFrame({"A":[1,2], "B":[3,4]},index=[1,2])

   A  B
1  1  3
2  2  4

In [4]:
pd.DataFrame({"A":[1,2], "B":[3,4]}, index=[1,2])

   A  B
1  1  3
2  2  4

In [5]:
pd.DataFrame({"A":[1,2], "B":[3,4]}, index=[1,2])

   A  B
1  1  3
2  2  4

In [6]:
pd.DataFrame({"A":[1,2,3], "b":[4,5,6]}, index=[1,2,3])

   A  b
1  1  4
2  2  5
3  3  6

In [7]:
pd.DataFrame({"A":[1,2], "B":[3,4], "C":[5,6]}, index=[1,2])

   A  B  C
1  1  3  5
2  2  4  6

In [8]:
pd.DataFrame([[1,3,5],[2,4,6]])

   0  1  2
0  1  3  5
1  2  4  6

In [10]:
pd.DataFrame([[1,4,7],[2,5,8],[3,6,9]])

   0  1  2
0  1  4  7
1  2  5  8
2  3  6  9

In [11]:
pd.DataFrame([[1,2,3],[4,5,6]], index=[1,2], columns=["A","B","C"])

   A  B  C
1  1  2  3
2  4  5  6

In [12]:
pd.DataFrame([[1,2,3,4],[5,6,7,8],[9,10,11,12],[13,14,15,16]], index=[1,2,3,4], columns=["A","B","C","D"])

    A   B   C   D
1   1   2   3   4
2   5   6   7   8
3   9  10  11  12
4  13  14  15  16

In [21]:
pd.DataFrame([[1,2,3],[4,5,6]], index=range(1,3), columns=["A","B","C"])

   A  B  C
1  1  2  3
2  4  5  6

In [23]:
pd.Series({"한국":"서울", "일본":"도쿄", "중국":"베이징"})

한국     서울
일본     도쿄
중국    베이징
dtype: object

In [26]:
import pandas as pd
import numpy as np
import random
import string
pd.DataFrame(np.random.randint(0, 100, size=(2, 3)))

    0   1   2
0  31  78  30
1  66   9  11

In [27]:
''.join(random.choice(string.ascii_letters) for i in range(5))

'yXWNc'

In [28]:
def id():
    return ''.join(random.choice(string.ascii_letters) for i in range(5))

In [29]:
def score():
    return np.random.randint(0,100)

In [94]:
pd.DataFrame([[score() for i in range(1,5)] for i in range(1,11)], columns=["국어","영어","수학","사회"], index=[id() for i in range(1,11)])

       국어  영어  수학  사회
SvdqW  57  51  26  83
iZbyr  82  97  38  53
bWrvp  63  79  77  16
qMQxP  98  15  15  49
HtAbw  95  33  59  88
wTBcS  71  22  31  64
mpktC  59  46  97  44
XGgXA  81  55  10  16
xjuuo  45  12  40  80
unKQv  74  86  22  74

In [ ]:
df = pd.DataFrame({"국어":score(), "영어":score(), "수학":score(), "사회":score()}, index=[id()])
for i in range(1,10):
    df.loc[id()] = {"국어":score(), "영어":score(), "수학":score(), "사회":score()}
df

In [79]:
[i for i in range(1,10)]

[1, 2, 3, 4, 5, 6, 7, 8, 9]